Revit 2024 API
AssetPropertyDoubleArray3d Class
 Represents a vector or point property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyDoubleArray3d : AssetProperty
Visual Basic
Public Class AssetPropertyDoubleArray3d _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDoubleArray3d : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
See Also
AssetPropertyDoubleArray3d Members
Autodesk.Revit.DB.Visual Namespace